anysphere.cursorpyright
astral-sh.ty
bungcip.better-toml
catppuccin.catppuccin-vsc
charliermarsh.ruff
eamodio.gitlens
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
vscodevim.vim
