cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'bat' # cat
brew 'coreutils' # https://apple.stackexchange.com/questions/69223/how-to-replace-mac-os-x-utilities-with-gnu-core-utilities
brew 'nvim'
brew 'ripgrep'
brew 'the_silver_searcher' # For ag
brew 'wget'
brew 'koekeishiya/formulae/yabai' # you may need --HEAD version
brew 'koekeishiya/formulae/skhd'
brew 'zsh'

cask 'docker'
cask 'google-chrome'
cask 'iterm2'
cask 'spectacle'
cask 'visual-studio-code'
cask 'whatsapp'
